package ch02.solution.quiz_2_1;

public class Problem09 {
    /**
     * 중괄호를 사용한 프로그램 구조
     */
    public static void main(String[] args) {
        /**
         * 클래스의 중괄호 {}
         * 1. 클래스 전체를 감싸서, 클래스의 범위를 지정
         * 2. 해당 클래스안의 변수, 메서드(함수), 생성자 등이 포함
         * 메서드의 중괄호 {}
         * 1. 해당 메서드 (=main)가 시작되고 끝나는 위치를 구분
         * 2. 메서드의 중괄호 안에만 실행 코드를 작성 가능
         * 그럼 왜 클래스 중괄호만 존재하면 안되는가 ?
         * -> 클래스의 중괄호는 프로그램의 전체의 틀일 뿐,
         * -> 실행할 코드를 구체적으로 지정하지 않음
         */
    }
}
